Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: `argument` is a container whose `begin()` and `end()` iterators are separated by a number of increments matching `m`.
it_it: `argument` è un contenitore i cui iteratori `begin()` e `end()` sono separati da un numero di incrementi pari a `m`.

source: `argument` is a container whose size matches `m`.
it_it: `argument` è un contenitore la cui dimensione corrisponde a `m`.

source: `argument` is a non-null pointer (raw or smart).
it_it: `argument` è un puntatore non-null (raw o smart).

source: `argument` is a reference to `variable`.
it_it: `argument` è un riferimento a `variable`.

source: `argument` is an `std::pair` whose `first` field matches `m1` and `second` field matches `m2`.
it_it: `argument` è una `std::pair` il cui `primo` campo corrisponde a `m1` e il `secondo` campo corrisponde a `m2`.

source: `argument` is an empty container (`container.empty()`).
it_it: `argument` è un contenitore vuoto (`container.empty()`).

source: `argument` is an empty string.
it_it: `argument` è una stringa vuota.

source: `argument` is any floating-point type with a NaN value.
it_it: `argument` è di tipo a virgola mobile con un valore NaN.

source: `argument` is equal to `string`, ignoring case.
it_it: `argument` è uguale a `string`, ignorando maiuscole e minuscole.

source: `argument` is equal to `string`.
it_it: `argument` è uguale a `string`.

source: `argument` is not equal to `string`, ignoring case.
it_it: `argument` è diverso da `string`, ignorando maiuscole e minuscole.

source: `argument` is not equal to `string`.
it_it: `argument` è diverso da `string`.

source: `argument` matches `UnorderedElementsAre(x0, x1, ..., xk)` for some subset `{x0, x1, ..., xk}` of the expected matchers.
it_it: `argument` corrisponde a `UnorderedElementsAre(x0, x1, ..., xk)` per qualche sottoinsieme `{x0, x1, ..., xk}` dei matcher attesi.

source: `argument` matches all of the matchers `m1` to `mn`.
it_it: `argument` corrisponde a tutti i matcher da `m1` a `mn`.

source: `argument` matches at least one of the matchers `m1` to `mn`.
it_it: `argument` corrisponde ad almeno uno dei matcher da `m1` a `mn`.

source: `argument` matches the given regular expression with the match starting at the first character and ending at the last character.
it_it: `argument` corrisponde all'espressione regolare data con la corrispondenza che inizia con il primo carattere e termina con l'ultimo carattere.

source: `argument` matches the given regular expression.
it_it: `argument` corrisponde all'espressione regolare data.

source: `argument` starts with string `prefix`.
it_it: `argument` inizia con la stringa `prefix`.

source: `current_test_info()` returns a null pointer if no test is running.
it_it: `current_test_info()` restituisce un puntatore nullo se non è in esecuzione alcun test.

source: `error`: gMock will print errors only (least verbose).
it_it: `error`: gMock stamperà solo gli errori (i meno dettagliati).

source: `f(argument)` matches matcher `m`, where `f` is a function or functor.
it_it: `f(argument)` corrisponde al matcher `m`, dove `f` è una funzione o un funtore.

source: `f` must take no arguments.
it_it: `f` non deve accettare argomenti.

source: `i` can range from 0 to `test_property_count() - 1`.
it_it: `i` può variare da 0 a `test_property_count() - 1`.

source: `i` can range from 0 to `total_part_count() - 1`.
it_it: `i` può variare da 0 a `total_part_count() - 1`.

source: `i` can range from 0 to `total_test_count() - 1`.
it_it: `i` può variare da 0 a `total_test_count() - 1`.

source: `i` can range from 0 to `total_test_suite_count() - 1`.
it_it: `i` può variare da 0 a `total_test_suite_count() - 1`.

source: `info`: gMock will print all informational messages, warnings, and errors (most verbose).
it_it: `info`: gMock stamperà tutti i messaggi informativi, i warning e gli errori (i più dettagliati).

source: `iteration` is the iteration index, starting from 0.
it_it: `iteration` è l'indice di iterazione, a partire da 0.

source: `m` in `Pointwise(m, ...)` and `UnorderedPointwise(m, ...)` should be a matcher for `::std::tuple<T, U>` where `T` and `U` are the element type of the actual container and the expected container, respectively.
it_it: `m` in `Pointwise(m, ...)` e `UnorderedPointwise(m, ...)` dovrebbe essere un matcher per `::std::tuple<T, U>` dove `T` e `U` sono rispettivamente il tipo di elemento del contenitore effettivo e del contenitore atteso.

source: `m` will match against the raw pointer regardless of the type of `argument`.
it_it: `m` corrisponderà al puntatore semplice indipendentemente dal tipo di `argument`.

source: `name_i` is the name of the *i*-th template parameter, and `kind_i` specifies whether it's a `typename`, an integral constant, or a template.
it_it: `name_i` è il nome dell'*i*-esimo parametro template, e `kind_i` specifica se si tratta di un `typename`, un integrale costante o un template.

source: `p_i` is the name of the *i*-th value parameter.
it_it: `p_i` è il nome del parametro valore *i*-esimo.

source: `predicate(argument)` returns something considered by C++ to be true, where `predicate` is a function or functor.
it_it: `predicate(argument)` restituisce qualcosa considerato true dal C++, dove `predicate` è una funzione o un funtore.

source: `statement` doesn't generate any new fatal failures in the current thread.
it_it: `statement` non genera nuovi errori fatali nel thread corrente.

source: `statement` in `EXPECT_FATAL_FAILURE{_ON_ALL_THREADS}()` cannot reference local non-static variables or non-static members of `this` object.
it_it: `statement` in `EXPECT_FATAL_FAILURE{_ON_ALL_THREADS}()` non può fare riferimento a variabili locali non statiche o a membri non statici dell'oggetto `this`.

source: `statement` in `EXPECT_FATAL_FAILURE{_ON_ALL_THREADS}()` cannot return a value.
it_it: `statement` in `EXPECT_FATAL_FAILURE{_ON_ALL_THREADS}()` non può restituire un valore.

source: `std::function` is a general function type introduced in C++11.
it_it: `std::function` è un tipo di funzione generale introdotto in C++11.

source: `std::unique_ptr<T>` is probably the most commonly used move-only type.
it_it: `std::unique_ptr<T>` è probabilmente il tipo di solo spostamento [move-only] più comunemente utilizzato.

source: `step` defaults to 1.
it_it: Il default di `step` è 1.

source: `t1.SetUp()` initializes `t1`.
it_it: `t1.SetUp()` inizializza `t1`.

source: `t1.TearDown()` cleans up after the test finishes.
it_it: `t1.TearDown()` esegue la pulizia al termine del test.

source: `t1` is destructed.
it_it: `t1` viene distrutto.

source: `testing::PrintToStringParamName` is a builtin test suffix generator that returns the value of `testing::PrintToString(GetParam())`.
it_it: `testing::PrintToStringParamName` è un generatore di suffissi nativo che restituisce il valore di `testing::PrintToString(GetParam())`.

source: `warning`: gMock will print both warnings and errors (less verbose); it will omit the stack traces in "uninteresting call" warnings.
it_it: `warning`: gMock stamperà sia i warning che gli errori (meno dettagliato); ometterà gli stack trace nei warning "uninteresting call".

source: a *design* tool, for it lets you experiment with your interface design early and often.
it_it: uno strumento di *design*, poiché consente di sperimentare subito e spesso il design dell'interfaccia.

source: a *testing* tool to cut your tests' outbound dependencies and probe the interaction between your module and its collaborators.
it_it: uno strumento di *test* per ridurre le dipendenze dagli output dei test e sondare l'interazione tra il modulo e i suoi collaboratori.

source: a design tool, for it lets you experiment with your interface design early and often.
it_it: strumento di design, poiché consente di sperimentare subito e spesso il design dell'interfaccia.

source: a testing tool to cut your tests' outbound dependencies and probe the interaction between your module and its collaborators.
it_it: uno strumento di test per ridurre le dipendenze dagli output dei test e sondare l'interazione tra il modulo e i suoi collaboratori.

source: a complex expression, or
it_it: un'espressione complessa, o

source: a compound statement.
it_it: un'istruzione composta.

source: a native array passed by reference (e.g. in Foo(const int (&a)[5])), and
it_it: un array nativo passato per riferimento (ad esempio in Foo(const int (&a)[5])) e

source: a native array passed by reference (e.g. in `Foo(const int (&a)[5])`), and
it_it: un array nativo passato per riferimento (ad esempio in `Foo(const int (&a)[5])`) e

source: a simple function call (often the case),
it_it: una semplice chiamata di funzione (spesso accade),

source: allows you to write
it_it: consente di scrivere

source: an array passed as a pointer and a count (e.g. in Bar(const T* buffer, int len) -- see Multi-argument Matchers).
it_it: un array passato come puntatore e un conteggio (ad esempio in Bar(const T* buffer, int len) -- vedere Matcher Multi-argomento).

source: an array passed as a pointer and a count (e.g. in `Bar(const T* buffer, int len)` -- see [Multi-argument Matchers](#MultiArgMatchers)).
it_it: un array passato come puntatore e un conteggio (ad esempio in `Bar(const T* buffer, int len)` -- vedere [Matcher Multi-argomento](#MultiArgMatchers)).

source: an uninteresting call, which is allowed but perhaps you forgot to explicitly ban the call), it prints some warning messages, including the arguments of the function, the return value, and the stack trace.
it_it: una chiamata poco interessante, che è consentita ma forse si è dimenticato di vietare esplicitamente la chiamata), stampa alcuni messaggi di warning, incluso gli argomenti della funzione, il valore restituito e il trace dello stack.

source: and
it_it: e

source: and running pkg-config again we get
it_it: ed eseguendo nuovamente pkg-config otteniamo

source: and running `pkg-config` again we get
it_it: ed eseguendo nuovamente `pkg-config` otteniamo

source: and supports the following operations:
it_it: e supporta le seguenti operazioni:

source: and want to verify that Foo(1) and Foo(3) both invoke mock.Bar("a"), but Foo(2) doesn't invoke anything, you can write:
it_it: e per verificare che Foo(1) e Foo(3) invochino entrambe mock.Bar("a"), ma che Foo(2) non invoca nulla, si può scrivere:

source: and want to verify that `Foo(1)` and `Foo(3)` both invoke `mock.Bar("a")`, but `Foo(2)` doesn't invoke anything, you can write:
it_it: e per verificare che `Foo(1)` e `Foo(3)` invochino entrambe `mock.Bar("a")`, ma che `Foo(2)` non invoca nulla, si può scrivere:

source: and you may want to invoke this callable argument:
it_it: e si potrebbe invocare questo argomento richiamabile:

source: any identifier that contains two consecutive underscores (i.e. __) anywhere in its name.
it_it: qualsiasi identificatore che contiene due underscore consecutivi (cioè __) ovunque nel suo nome.

source: any identifier that contains two consecutive underscores (i.e. `__`) *anywhere* in its name.
it_it: qualsiasi identificatore che contiene due underscore consecutivi (cioè `__`) *ovunque* nel suo nome.

source: any identifier that starts with an _ followed by an upper-case letter, and
it_it: qualsiasi identificatore che inizia con un _ seguito da una lettera maiuscola e

source: any identifier that starts with an `_` followed by an upper-case letter, and
it_it: qualsiasi identificatore che inizia con un `_` seguito da una lettera maiuscola e

source: as shorthand for
it_it: come abbreviazione di

source: as soon as either #2 or #3 is matched, #1 will retire.
it_it: non appena il #2 o il #3 verranno abbinati [match], il #1 verrà ritirato.

source: bool MutuallyPrime(int m, int n) { ... } // A predicate-formatter for asserting that two integers are mutually prime.
it_it: bool MutuallyPrime(int m, int n) { ... } // Un predicate-formatter per affermare che due numeri interi sono reciprocamente primi.

source: calling Foo(5) causes the process to die with the given error message,
it_it: la chiamata a Foo(5) provoca la morte del processo con il messaggio di errore indicato,

source: calling KillProcess() kills the process with signal SIGKILL.
it_it: la chiamata a KillProcess() termina [kill] il processo con il segnale SIGKILL.

source: calling NormalExit() causes the process to print "Success" to stderr and exit with exit code 0, and
it_it: la chiamata a NormalExit() fa sì che il processo stampi "Success" su stderr e esca con il codice di uscita 0, e

source: calling `Foo(5)` causes the process to die with the given error message,
it_it: la chiamata a `Foo(5)` provoca la morte del processo con il messaggio di errore indicato,

source: calling `KillProcess()` kills the process with signal `SIGKILL`.
it_it: la chiamata a `KillProcess()` termina [kill] il processo con il segnale `SIGKILL`.

source: calling `NormalExit()` causes the process to print `"Success"` to stderr and exit with exit code 0, and
it_it: la chiamata a `NormalExit()` fa sì che il processo stampi `"Success"` su stderr e esca con il codice di uscita 0, e

source: calls the mock function's #2 argument, passing to it 5 and string("Hi") by value, and foo by reference.
it_it: chiama l'argomento #2 della funzione mock, passandogli 5 e string("Hi") per valore e foo per riferimento.

source: calls the mock function's #2 argument, passing to it `5` and `string("Hi")` by value, and `foo` by reference.
it_it: chiama l'argomento #2 della funzione mock, passandogli `5` e `string("Hi")` per valore e `foo` per riferimento.

source: casts matcher m to type Matcher<T>.
it_it: cast del matcher m nel tipo Matcher<T>.

source: casts matcher `m` to type `Matcher<T>`.
it_it: cast del matcher `m` nel tipo `Matcher<T>`.

source: cmake_minimum_required(VERSION 3.14) project(my_project) # GoogleTest requires at least C++14 set(CMAKE_CXX_STANDARD 14) set(CMAKE_CXX_STANDARD_REQUIRED ON) include(FetchContent) FetchContent_Declare(
it_it: cmake_minimum_required(VERSION 3.14) project(my_project) # GoogleTest richiede almeno C++14 set(CMAKE_CXX_STANDARD 14) set(CMAKE_CXX_STANDARD_REQUIRED ON) include(FetchContent) FetchContent_Declare(

source: const int Foo::kBar; // No initializer here.
it_it: const int Foo::kBar; // Nessun inizializzatore qui.

source: could generate this report:
it_it: potrebbe generare questo report:

source: could result in messages like these:
it_it: potrebbe generare messaggi come questi:

source: creates an action that passes the arguments of the mock function at the given indices (0-based) to the inner action and performs it.
it_it: crea un'azione che passa gli argomenti della funzione mock agli indici dati (in base 0) all'action interna e la esegue.

source: creates an action that passes the arguments of the mock function at the given indices (0-based) to the inner `action` and performs it.
it_it: crea un'azione che passa gli argomenti della funzione mock agli indici dati (in base 0) all'`action` interna e la esegue.

source: data-driven testing).
it_it: test basati sui dati [data-driven testing]).

source: defines an action Foo() that invokes argument #2 (a function pointer) with 5, calls function Blah(), sets the value pointed to by argument #1 to 0, and returns argument #0.
it_it: definisce un'azione Foo() che invoca l'argomento #2 (un puntatore a funzione) con 5, chiama la funzione Blah(), imposta il valore puntato dall'argomento #1 a 0 e restituisce l'argomento #0.

source: defines an action `Foo()` that invokes argument #2 (a function pointer) with 5, calls function `Blah()`, sets the value pointed to by argument #1 to 0, and returns argument #0.
it_it: definisce un'azione `Foo()` che invoca l'argomento #2 (un puntatore a funzione) con 5, chiama la funzione `Blah()`, imposta il valore puntato dall'argomento #1 a 0 e restituisce l'argomento #0.

source: defines an action template that takes *m* explicit template parameters and *n* value parameters, where *m* is in [1, 10] and *n* is in [0, 10].
it_it: definisce una action template che accetta *m* parametri template espliciti e *n* parametri di valore, dove *m* è in [1, 10] e *n* è in [0, 10].

source: defines an action template that takes m explicit template parameters and n value parameters, where m is in 1, 10 and n is in 0, 10.
it_it: definisce una action template che accetta m parametri template espliciti e n parametri di valore, dove m è in 1, 10 e n è in 0, 10.

source: delete p; // Surprise!
it_it: delete p; // Sorpresa!

source: do not use the heap checker in your program.
it_it: non utilizzare l'heap checker nel programma.

source: does statement abort or exit the process?
it_it: con l'istruzione si abortisce o si esce dal processo?

source: does `statement` abort or exit the process?
it_it: con l'`istruzione` si abortisce o si esce dal processo?

source: does the stderr output match matcher?
it_it: l'output su stderr corrisponde al matcher?

source: does the stderr output match `matcher`?
it_it: l'output su stderr corrisponde al `matcher`?

source: etc).
it_it: ecc.).

source: etc.).
it_it: ecc.).

source: evaluates to true if value matches m, explaining the result to result_listener.
it_it: restituisce true se value corrisponde a m, spiegando il risultato a result_listener.

source: evaluates to true if value matches m.
it_it: restituisce true se value corrisponde a m.

source: evaluates to `true` if `value` matches `m`, explaining the result to `result_listener`.
it_it: restituisce `true` se `value` corrisponde a `m`, spiegando il risultato a `result_listener`.

source: evaluates to `true` if `value` matches `m`.
it_it: restituisce `true` se `value` corrisponde a `m`.

source: expects foo.Bar() to be called with a pointer that points to a value greater than or equal to 3.
it_it: si aspetta che foo.Bar() venga chiamato con un puntatore che punta a un valore maggiore o uguale a 3.

source: expects `foo.Bar()` to be called with a pointer that points to a value greater than or equal to 3.
it_it: si aspetta che `foo.Bar()` venga chiamato con un puntatore che punta a un valore maggiore o uguale a 3.

source: first, you use some simple macros to describe the interface you want to mock, and they will expand to the implementation of your mock class;
it_it: per prima cosa si usano alcune semplici macro per descrivere l'interfaccia che si vuol simulare [mock] e queste si espanderanno nell'implementazione della classe mock;

source: foo.Baz(&n); // Should return 5 and change n to 6.
it_it: foo.Baz(&n); // Dovrebbe restituire 5 e cambiare n in 6.

source: foo.CalculateBar(); // This should return default_bar.
it_it: foo.CalculateBar(); // Questo dovrebbe restituire default_bar.

source: foo.ComplexJob(-1); // Invokes the inline lambda.
it_it: foo.ComplexJob(-1); // Invoca la lambda inline.

source: foo.ComplexJob(10); // Invokes helper.ComplexJob(10).
it_it: foo.ComplexJob(10); // Invoca helper.ComplexJob(10).

source: foo.ComplexJob(10); // Invokes Job1().
it_it: foo.ComplexJob(10); // Invoca Job1().

source: foo.ComplexJob(20); // Invokes Job2(5, 'a').
it_it: foo.ComplexJob(20); // Invoca Job2(5, 'a').

source: foo.DoThat(); // Returns 1 - DoThat() uses a different
it_it: foo.DoThat(); // Restituisce 1 - DoThat() usa un contatore

source: foo.DoThat(); // Returns 3 - the counter is shared.
it_it: foo.DoThat(); // Restituisce 3 - il contatore è condiviso.

source: foo.DoThat(1, "Hi", "Bye"); // Will return "Hi".
it_it: foo.DoThat(1, "Hi", "Bye"); // Restituirà "Hi".

source: foo.DoThis(); // Returns 1.
it_it: foo.DoThis(); // Restituisce 1.

source: foo.DoThis(); // Returns 2.
it_it: foo.DoThis(); // Restituisce 2.

source: foo.DoThis(true, 5); // Will return 5.
it_it: foo.DoThis(true, 5); // Restituirà 5.

source: foo.Sign(-9); // This should return -1.
it_it: foo.Sign(-9); // Questo dovrebbe restituire -1.

source: foo.Sign(0); // This should return 0.
it_it: foo.Sign(0); // Questo dovrebbe restituire 0.

source: foo.Sign(5); // This should return 1.
it_it: foo.Sign(5); // Questo dovrebbe restituire 1.

source: foo.Sum(2, 3); // Invokes Sum3(1, 2, 3).
it_it: foo.Sum(2, 3); // Invoca Sum3(1, 2, 3).

source: foo.Sum(5, 6); // Invokes CalculateSum(5, 6).
it_it: foo.Sum(5, 6); // Invoca CalculateSum(5, 6).

source: free the memory again in the parent process; or
it_it: liberare nuovamente la memoria nel processo genitore; o

source: further required flags (-pthread)
it_it: ulteriori flag richiesti (-pthread)

source: gMock lets you do that by referencing the matcher parameters in the description string expression.
it_it: gMock consente di farlo facendo riferimento ai parametri del matcher nell'espressione della stringa della descrizione.

source: gMock Cheat Sheet
it_it: Cheat Sheet di gMock

source: gMock Cookbook
it_it: Ricettario di gMock

source: gMock allows you to impose an arbitrary DAG (directed acyclic graph) on the calls.
it_it: gMock consente di imporre un DAG (directed acyclic graph) arbitrario sulle chiamate.

source: gMock also provides ACTION_P2, ACTION_P3, and etc to support multi-parameter actions.
it_it: gMock fornisce anche ACTION_P2, ACTION_P3 e così via per supportare azioni multi-parametro.

source: gMock also provides MATCHER_P2, MATCHER_P3, ..., up to MATCHER_P10 to support multi-parameter matchers:
it_it: gMock fornisce anche MATCHER_P2, MATCHER_P3, ..., fino a MATCHER_P10 per supportare i matcher multiparametro:

source: gMock also provides `ACTION_P2`, `ACTION_P3`, and etc to support multi-parameter actions.
it_it: gMock fornisce anche `ACTION_P2`, `ACTION_P3` e così via per supportare azioni multi-parametro.

source: gMock also provides `MATCHER_P2`, `MATCHER_P3`, ..., up to `MATCHER_P10` to support multi-parameter matchers:
it_it: gMock fornisce anche `MATCHER_P2`, `MATCHER_P3`, ..., fino a `MATCHER_P10` per supportare i matcher multiparametro:

source: gMock and ScopedMockLog are likely doing the right thing here.
it_it: gMock e ScopedMockLog probabilmente stanno facendo la cosa giusta in questo caso.

source: gMock and `ScopedMockLog` are likely doing the right thing here.
it_it: gMock e `ScopedMockLog` probabilmente stanno facendo la cosa giusta in questo caso.

source: gMock and googletest do this using googletest's user-extensible value printer.
it_it: gMock e googletest lo fanno utilizzando la stampante di valori estensibile dall'utente di googletest.

source: gMock can mock non-virtual functions to be used in Hi-perf dependency injection.
it_it: gMock può produrre versioni mock di funzioni non-virtual da utilizzare nell'inserimento [injection] delle dipendenze Hi-perf.

source: gMock defines a convenient mock class template
it_it: gMock definisce un comodo template di classe mock

source: gMock does *not* impose a sequence on actions performed in different threads (doing so may create deadlocks as the actions may need to cooperate).
it_it: gMock *non* impone una sequenza sulle azioni eseguite in thread diversi (farlo potrebbe creare situazioni di stallo poiché le azioni potrebbero dover cooperare).

source: gMock does not impose a sequence on actions performed in different threads (doing so may create deadlocks as the actions may need to cooperate).
it_it: gMock non impone una sequenza sulle azioni eseguite in thread diversi (farlo potrebbe creare situazioni di stallo poiché le azioni potrebbero dover cooperare).

source: gMock for Dummies
it_it: gMock per Principianti

source: gMock guarantees that the action for a mock function is done in the same thread that called the mock function.
it_it: gMock garantisce che l'azione per una funzione mock venga eseguita nello stesso thread che ha chiamato la funzione mock.

source: gMock handles them all.
it_it: gMock li gestisce tutti.
